Terraform plan for __production__
<details>
  <summary>Plan: 6 to add, 0 to change, 0 to destroy.</summary>

```hcl
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # cloudfoundry_service_instance.k8s_cluster will be created
  + resource "cloudfoundry_service_instance" "k8s_cluster" {
      + id               = (known after apply)
      + name             = "ssb-k8s"
      + recursive_delete = false
      + service_plan     = "8d0b0664-8c1f-4918-9b8d-ad50ac49ecd9"
      + space            = "9a1db116-0180-42be-8ffa-7944dcf6bf50"
      + tags             = [
          + "k8s",
        ]

      + timeouts {
          + create = "30m"
        }
    }

  # module.broker_solr.cloudfoundry_app.ssb will be created
  + resource "cloudfoundry_app" "ssb" {
      + buildpack                  = "binary_buildpack"
      + command                    = "source .profile && ./cloud-service-broker serve"
      + disk_quota                 = 2048
      + enable_ssh                 = false
      + environment                = (sensitive value)
      + health_check_http_endpoint = (known after apply)
      + health_check_timeout       = (known after apply)
      + health_check_type          = "port"
      + id                         = (known after apply)
      + id_bg                      = (known after apply)
      + instances                  = 1
      + memory                     = 256
      + name                       = "ssb-solr"
      + path                       = "./app-ssb-solr.zip"
      + ports                      = (known after apply)
      + source_code_hash           = "RrwYpMoh/xKGoHOwyE8XYO3+Ef1OCBgQow1ZUZ/qeN8="
      + space                      = "9a1db116-0180-42be-8ffa-7944dcf6bf50"
      + stack                      = (known after apply)
      + stopped                    = false
      + strategy                   = "blue-green"
      + timeout                    = 60

      + routes {
          + port  = (known after apply)
          + route = "178725bd-3eda-4a84-abd6-a848305978d5"
        }

      + service_binding {
          + service_instance = "3c73e801-d72e-4c60-aec7-26a29edab9dc"
        }
      + service_binding {
          + service_instance = (known after apply)
        }
    }

  # module.broker_solr.cloudfoundry_service_broker.space_scoped_broker["gsa-datagov/development"] will be created
  + resource "cloudfoundry_service_broker" "space_scoped_broker" {
      + catalog_change                   = false
      + catalog_hash                     = (known after apply)
      + fail_when_catalog_not_accessible = true
      + id                               = (known after apply)
      + name                             = "ssb-ssb-solr-gsa-datagov-development"
      + password                         = (sensitive value)
      + service_plans                    = (known after apply)
      + services                         = (known after apply)
      + space                            = "eab3d327-7d9f-423b-9838-753c26fdb5a0"
      + url                              = "https://ssb-improved-bunny.app.cloud.gov"
      + username                         = "63d2d47d-f315-c647-31fd-9d60600fee89"
    }

  # module.broker_solr.cloudfoundry_service_broker.space_scoped_broker["gsa-datagov/management"] will be created
  + resource "cloudfoundry_service_broker" "space_scoped_broker" {
      + catalog_change                   = false
      + catalog_hash                     = (known after apply)
      + fail_when_catalog_not_accessible = true
      + id                               = (known after apply)
      + name                             = "ssb-ssb-solr-gsa-datagov-management"
      + password                         = (sensitive value)
      + service_plans                    = (known after apply)
      + services                         = (known after apply)
      + space                            = "9a1db116-0180-42be-8ffa-7944dcf6bf50"
      + url                              = "https://ssb-improved-bunny.app.cloud.gov"
      + username                         = "63d2d47d-f315-c647-31fd-9d60600fee89"
    }

  # module.broker_solr.cloudfoundry_service_broker.space_scoped_broker["gsa-datagov/prod"] will be created
  + resource "cloudfoundry_service_broker" "space_scoped_broker" {
      + catalog_change                   = false
      + catalog_hash                     = (known after apply)
      + fail_when_catalog_not_accessible = true
      + id                               = (known after apply)
      + name                             = "ssb-ssb-solr-gsa-datagov-prod"
      + password                         = (sensitive value)
      + service_plans                    = (known after apply)
      + services                         = (known after apply)
      + space                            = "acbabadb-2604-4736-81f7-01288b0371c6"
      + url                              = "https://ssb-improved-bunny.app.cloud.gov"
      + username                         = "63d2d47d-f315-c647-31fd-9d60600fee89"
    }

  # module.broker_solr.cloudfoundry_service_broker.space_scoped_broker["gsa-datagov/staging"] will be created
  + resource "cloudfoundry_service_broker" "space_scoped_broker" {
      + catalog_change                   = false
      + catalog_hash                     = (known after apply)
      + fail_when_catalog_not_accessible = true
      + id                               = (known after apply)
      + name                             = "ssb-ssb-solr-gsa-datagov-staging"
      + password                         = (sensitive value)
      + service_plans                    = (known after apply)
      + services                         = (known after apply)
      + space                            = "3e692cdd-6d26-41ea-9698-04903dc3f742"
      + url                              = "https://ssb-improved-bunny.app.cloud.gov"
      + username                         = "63d2d47d-f315-c647-31fd-9d60600fee89"
    }

Plan: 6 to add, 0 to change, 0 to destroy.
```
</details>

Plan generated in [plan #15](https://github.com/GSA/datagov-ssb/actions/runs/669697794)